{
  "home-page": {
    "developer": "Full-Stack Developer",
    "hero-content": "The excitement I felt on my first day stepping into the world of coding has only grown stronger over the years. Overcoming challenges with creative solutions is one of the key factors that motivates me in this field. In my projects, I prioritize both technical excellence and visual harmony, aiming to deliver high-quality and impressive results by meticulously addressing every detail. On my website, you can explore my projects, learn more about me, and review my CV for detailed information about my professional experiences.",
    "button-text": "Download CV",
    "github-button-text": "View on GitHub",
    "about-first": "Who",
    "about-second": "Am I?",
    "techs-title": "Technologies I Work With",
    "job-experience-title": "Job Experiences",
    "projects-title": "Projects",
    "about-text": "I have expertise in powerful frameworks such as Node.js and Next.js, with a strong foundation in modern software development practices. I effectively utilize DevOps tools such as containerization, CI/CD, and cloud technologies to design scalable, reliable, and high-performance systems. I’m experienced in building strong communication with teams and clients, ensuring collaboration, understanding technical requirements, and contributing value at every stage of a project. My goal is to leverage technology strategically to develop innovative and sustainable solutions.clients, contributing at every stage of the projects. I am open to freelance opportunities and aim to create value by leveraging my technical expertise in innovative projects.",
    "experiences": [
      {
        "year": "July 2023 - September 2023",
        "role": "Full-Time Frontend Developer",
        "company": "BulutMD Software",
        "description": "Designed and developed user interfaces for web applications using Next.js and React. Collaborated closely with backend developers to integrate frontend components with Spring Boot APIs. Implemented responsive designs and optimized frontend performance. Managed CI/CD processes to accelerate deployment and ensure continuous delivery. Contributed to the development of an ERP application, enhancing its functionality and scalability.",
        "technologies": ["HTML", "CSS", "JavaScript", "React.js", "Next.js", "Material-UI"]
      }   ,
      {
        "year": "July 2025 - August 2025",
        "role": "Intern",
        "company": "Orca Business Solutions",
        "description": "Developed a system that automatically monitors customer servers and implements specific critical scenarios (e.g., backup operations and log file size tracking). Designed and developed the project as a full-stack application. Created APIs using Node.js and Express.js for the backend, and developed the user interface with Next.js for the frontend. Used PostgreSQL as the database and established a container-based architecture with Docker to enhance the portability and manageability of the application. Managed inter-system communication with RabbitMQ and ensured high-performance data flow.",
        "technologies": ["Node.js", "Express.js", "JavaScript", "Next.js", "Docker", "PostgreSQL", "RabbitMQ"]
      }
    ],
    "projects": [
      {
        "title": "Marketa E-Commerce Platform",
        "image": "/assets/projects/project-1.jpg",
        "description": "Marketa is an e-commerce project where I implemented a microservices architecture. The project provided me with in-depth experience in utilizing microservices effectively, helping me anticipate potential challenges of an e-commerce system.",
        "technologies": ["Java", "MySQL", "PostgreSQL", "Apache Kafka", "Spring", "Keycloak", "Grafana", "Prometheus", "Docker", "Spring Cloud Gateway"],
        "githubLink": "https://github.com/ruskyvisky/Marketa-Backend"
      },
      {
        "title": "Fullstack Veterinary Clinic Management System",
        "image": "/assets/projects/project-5.png",
        "description": "This comprehensive management system for veterinary clinics provided significant experience in developing software tailored to an organization’s needs. The project helped optimize processes such as stock management, accounting, animal treatment records, and new animal registrations for veterinarians. Additionally, it enabled pet owners to easily track their pets' health and treatment progress via the system, offering a user-friendly experience for both sides. By combining functionality with user experience, I aimed to enhance the operational efficiency of a real-world organization.",
        "technologies": ["React", "Next.js", "Java", "Spring Boot", "Spring Security", "MySQL", "Redux", "Ant Design"],
        "githubLink": "https://github.com/ruskyvisky/Veteriner-app"
      },
      {
        "title": "Orca Watch Tower",
        "image": "/assets/projects/project-4.png",
        "description": "Orca Watch Tower is a system that automatically monitors customer servers and implements specific critical scenarios (e.g., backup operations and log file size tracking). I designed and developed the project as a full-stack application. I created APIs using Node.js and Express.js for the backend, and developed the user interface with Next.js for the frontend. I used PostgreSQL as the database and established a container-based architecture with Docker to enhance the portability and manageability of the application. I managed inter-system communication with RabbitMQ and ensured high-performance data flow.",
        "technologies": ["Node.js", "Next.js", "Tailwind CSS", "Express.js", "Docker", "PostgreSQL", "RabbitMQ"],
        "githubLink": "https://github.com/ruskyvisky/system-monitoring-app"
      },
      {
        "title": "Netflix Clone",
        "image": "/assets/projects/project-3.png",
        "description": "This Netflix clone project is a feature-rich web application that allows users to save their favorite movies in personalized lists and access them seamlessly across devices. The project includes user registration, login, and cookie-based authentication processes, along with third-party login options via Google and GitHub. I designed modern, animated components using Tailwind CSS to enhance visual appeal and ensure mobile responsiveness. With the movie streaming feature, it offers a complete entertainment platform, enriching the user experience. This project provided me with valuable experience in exploring new technologies, preparing me to effectively use them in future projects.",
        "technologies": ["HTML", "CSS", "React.js", "Next.js", "PostgreSQL", "NextAuth.js", "Tailwind CSS", "Prisma.js"],
        "githubLink": "https://github.com/ruskyvisky/netflix-app"
      },
      {
        "title": "Fullstack Event Management Web Application",
        "image": "/assets/projects/project-2.jpg",
        "description": "This event management application allows users to register, create events, and participate in existing ones through a comprehensive platform. I designed a user-friendly interface for event creation and participant management. On the backend, I securely handled authentication and data processing to protect user information. By seamlessly integrating frontend and backend technologies, I built a robust and reliable system. This project showcases my technical expertise and serves as an impressive example for my portfolio.",
        "technologies": ["HTML", "CSS", "React", "Next.js", "Java", "Spring Boot", "Spring Security", "MySQL", "Chakra-UI"],
        "githubLink": "https://github.com/ruskyvisky/Event-Organizator-Frontend"
      }
    ]
  }
}
