
{

  "home-page": {
      "developer": "Full-Stack Geliştirici",
      "hero-content": "Kodlama dünyasına adım attığım ilk gün duyduğum heyecan, yıllar içinde hiç azalmadan büyümeye devam ediyor. Zorlukların üstesinden yaratıcı çözümlerle gelmek, beni bu alanda motive eden en önemli unsurlardan biri. Projelerimde hem teknik mükemmeliyet hem de görsel uyum önceliklerim arasında yer alıyor; her detayı titizlikle ele alarak kaliteli ve etkileyici sonuçlar ortaya koymayı hedefliyorum. Web sitemde projelerim ve hakkımda daha fazla bilgiye ulaşabilir, CV'mi inceleyerek profesyonel deneyimlerim hakkında detaylı bilgi edinebilirsiniz.",
      "button-text": "CV'yi İndir",
      "github-button-text": "GitHub'da Görüntüle",
      "about-first": "Ben",
      "about-second": "Kimim?",
      "techs-title": "Çalıştığım Teknolojiler",
      "job-experience-title": "İş Deneyimleri",
      "projects-title": "Projeler",
      "about-text": "Node.js ve Next.js gibi güçlü framework’lerde uzmanlık sahibiyim ve modern yazılım geliştirme süreçlerinde derin bir bilgi birikimine sahibim. Ölçeklenebilir, güvenilir ve yüksek performanslı sistemler tasarlamak için konteynerleştirme, CI/CD ve bulut teknolojileri gibi DevOps araçlarını etkin bir şekilde kullanıyorum. Ekiplerle ve müşterilerle güçlü iletişim kurarak işbirliğini artırma, teknik gereksinimleri doğru anlama ve projelerin her aşamasına değer katma konusunda deneyimliyim. Amacım, teknolojiyi stratejik bir şekilde kullanarak yenilikçi ve sürdürülebilir çözümler geliştirmektir.",
      "experiences": [
        {
          "year": "2023 Temmuz - 2023 Eylül",
          "role": "Tam Zamanlı Frontend Geliştirici",
          "company": "BulutMD Yazılım",
          "description": "Next.js ve React kullanarak web uygulamaları için kullanıcı arayüzleri tasarladım ve geliştirdim. Frontend bileşenlerini Spring Boot API'leriyle entegre etmek için backend geliştiricilerle yakın çalıştım. Duyarlı tasarımlar uyguladım ve frontend performansını optimize ettim. CI/CD süreçlerini yöneterek dağıtımı hızlandırdım ve sürekli teslimatı sağladım. ERP uygulamasının geliştirilmesine katkıda bulundum, işlevselliğini ve ölçeklenebilirliğini artırdım.",
          "technologies": ["HTML", "CSS", "JavaScript", "React.js", "Next.js", "Material-UI"]
        },
         {
          "year": "2025 Temmuz - 2025 Ağustos",
          "role": "Yaz Stajyeri",
          "company": "Orca İş Çözümleri",
"description": "Müşteri sunucularını izleyen ve belirli önemli senaryoları (örneğin yedekleme işlemleri ve log dosya boyutu takibi) otomatik olarak uygulayan bir sistem geliştirdim. Projeyi full-stack olarak tasarladım ve geliştirdim. Backend tarafında API’leri Node.js ve Express.js ile oluşturdum, frontend tarafında ise Next.js ile kullanıcı arayüzünü geliştirdim. Veritabanı olarak PostgreSQL kullandım ve Docker ile container tabanlı bir mimari kurarak uygulamanın taşınabilirliğini ve yönetilebilirliğini artırdım. RabbitMQ ile sistem içi iletişimi yönettim ve yüksek performanslı veri akışı sağladım.",
"technologies": ["Node.js", "Express.js", "JavaScript", "Next.js", "Docker", "PostgreSQL", "RabbitMQ"]

        }
      ],
      "projects": [
        {
          "title": "Marketa E-Ticaret Platformu",
          "image": "/assets/projects/project-1.jpg",
          "description": "Marketa, mikroservis mimarisi geliştirdiğim bir E-ticaret projesidir. Bu projede mikroservis mimarisini detaylı ve etkin bir şekilde kullanmayı amaçladım. Genel hatlarıyla bir e-ticaret sisteminin gerekliliklerini ve gelecekte yaşanabilecek problemleri öngörebilmemi sağladı.",
          "technologies": ["Java", "MySQL", "PostgreSQL", "Apache Kafka", "Spring", "Keycloak", "Grafana", "Prometheus", "Docker", "Spring Cloud Gateway"],
          "githubLink": "https://github.com/ruskyvisky/Marketa-Backend"
        },
        {
          "title": "Fullstack Veteriner Klinik Yönetim Sistemi",
          "image": "/assets/projects/project-5.png",
          "description": "Veteriner klinikleri için geliştirdiğim kapsamlı yönetim sistemi projesi, bir kurumun ihtiyaçlarına göre yazılım geliştirme konusunda bana önemli bir deneyim kazandırdı. Bu proje kapsamında veterinerlerin stok yönetimi, muhasebe işlemleri, hayvan tedavi kayıtları ve yeni hayvan kayıtlarının oluşturulması gibi süreçlerini optimize etmelerine yardımcı oldum. Ayrıca, evcil hayvan sahiplerinin sistem üzerinden evcil hayvanlarının sağlık ve tedavi ilerlemesini kolayca takip edebilmelerini sağlayarak her iki taraf için kullanıcı dostu bir deneyim tasarladım. Bu projeyle, işlevselliği ve kullanıcı deneyimini bir arada sunarak, gerçek dünyadaki bir kurumun operasyonel verimliliğini artırmayı hedefledim.",
          "technologies": ["React", "Next.js", "Java", "Spring Boot", "Spring Security", "MySQL", "Redux", "Ant Design"],
          "githubLink": "https://github.com/ruskyvisky/Veteriner-app"
        },
        {
          "title": "Orca Watch Tower",
          "image": "/assets/projects/project-4.png",
          "description": "Orca Watch Tower, müşteri sunucularını izleyen ve belirli önemli senaryoları (örneğin yedekleme işlemleri ve log dosya boyutu takibi) otomatik olarak uygulayan bir sistemdir. Projeyi full-stack olarak tasarladım ve geliştirdim. Backend tarafında API’leri Node.js ve Express.js ile oluşturdum, frontend tarafında ise Next.js ile kullanıcı arayüzünü geliştirdim. Veritabanı olarak PostgreSQL kullandım ve Docker ile container tabanlı bir mimari kurarak uygulamanın taşınabilirliğini ve yönetilebilirliğini artırdım. RabbitMQ ile sistem içi iletişimi yönettim ve yüksek performanslı veri akışı sağladım.",
          "technologies": ["Node.js", "Next.js", "Tailwind CSS", "Express.js" , "Docker", "PostgreSQL", "RabbitMQ"],
          "githubLink": "https://github.com/ruskyvisky/system-monitoring-app"
        },
        {
          "title": "Netflix Klonu",
          "image": "/assets/projects/project-3.png",
          "description": "Geliştirdiğim Netflix klon projesi, kullanıcıların favori filmlerini kişiselleştirilmiş listelerde saklayabildiği, cihazlar arasında sorunsuz erişim sağlayan zengin özelliklere sahip bir web uygulamasıdır. Proje kapsamında kullanıcı kaydı, giriş ve çerez tabanlı kimlik doğrulama süreçlerini entegre ettim; ayrıca Google ve GitHub ile üçüncü taraf giriş özelliklerini ekledim. Görsel çekicilik için Tailwind CSS ile modern, animasyonlu bileşenler tasarladım ve mobil uyumlu bir yapı oluşturdum. Film akışı özelliğiyle tam bir eğlence platformu sunarak kullanıcı deneyimini zenginleştirdim. Bu projede yeni teknolojileri deneyimleme fırsatı bulmam, gelecekte bu araçları farklı projelerde etkin bir şekilde kullanabileceğim konusunda bana önemli bir tecrübe kazandırdı.",
          "technologies": ["HTML", "CSS", "React.js", "Next.js", "PostgreSQL", "NextAuth.js", "Tailwind CSS", "Prisma.js"],
          "githubLink": "https://github.com/ruskyvisky/netflix-app"
        },
        {
          "title": "Fullstack Etkinlik Yönetimi Web Uygulaması",
          "image": "/assets/projects/project-2.jpg",
          "description": "Geliştirdiğim  etkinlik yönetimi uygulaması, kullanıcıların kayıt olmasını, etkinlik oluşturmasını ve mevcut etkinliklere katılmasını sağlayan kapsamlı bir platformdur. Etkinlik oluşturma ve katılımcı yönetimi için kullanıcı dostu ve basit bir arayüz tasarladım. Uygulamanın backend tarafında, kimlik doğrulama ve veri işleme süreçlerini güvenli bir şekilde ele alarak, kullanıcı bilgilerinin korunmasını sağladım. Frontend ve backend teknolojilerini sorunsuz bir şekilde entegre ederek güçlü ve güvenilir bir sistem oluşturdum. Bu projede, hem teknik uzmanlığımı sergileyen hem de portföyüm için etkileyici bir örnek teşkil eden bir çözüm geliştirmeye odaklandım.",
          "technologies": ["HTML", "CSS", "React", "Next.js", "Java", "Spring Boot", "Spring Security", "MySQL", "Chakra-UI"],
          "githubLink": "https://github.com/ruskyvisky/Event-Organizator-Frontend"
        }

      ]
    }
  }
  